experiment/raw/rolling_run2_wrk_stdout.txt
Running 2m test @ http://192.168.49.2:30080/health
  2 threads and 4 connections
  Thread calibration: mean lat.: 3.368ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.358ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.06ms   20.12ms 270.59ms   98.91%
    Req/Sec     2.65     20.21   222.00     98.10%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.02ms
 75.000%    3.81ms
 90.000%    4.71ms
 99.000%   68.29ms
 99.900%  266.24ms
 99.990%  270.85ms
 99.999%  270.85ms
100.000%  270.85ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.197     0.000000            1         1.00
       1.984     0.100000           55         1.11
       2.279     0.200000          110         1.25
       2.541     0.300000          165         1.43
       2.803     0.400000          221         1.67
       3.021     0.500000          274         2.00
       3.177     0.550000          303         2.22
       3.301     0.600000          329         2.50
       3.457     0.650000          357         2.86
       3.579     0.700000          384         3.33
       3.813     0.750000          411         4.00
       3.929     0.775000          426         4.44
       4.009     0.800000          439         5.00
       4.167     0.825000          453         5.71
       4.387     0.850000          466         6.67
       4.571     0.875000          480         8.00
       4.679     0.887500          488         8.89
       4.719     0.900000          494        10.00
       4.807     0.912500          501        11.43
       5.031     0.925000          507        13.33
       5.171     0.937500          514        16.00
       5.299     0.943750          518        17.78
       5.591     0.950000          521        20.00
       5.795     0.956250          525        22.86
       5.907     0.962500          528        26.67
       6.395     0.968750          531        32.00
       6.631     0.971875          533        35.56
       7.407     0.975000          535        40.00
       8.255     0.978125          537        45.71
       8.343     0.981250          538        53.33
       8.991     0.984375          540        64.00
      12.927     0.985938          541        71.11
      20.319     0.987500          542        80.00
      68.287     0.989062          543        91.43
      68.287     0.990625          543       106.67
      68.607     0.992188          544       128.00
      71.359     0.992969          545       142.22
      71.359     0.993750          545       160.00
     265.727     0.994531          546       182.86
     265.727     0.995313          546       213.33
     265.727     0.996094          546       256.00
     266.239     0.996484          547       284.44
     266.239     0.996875          547       320.00
     266.239     0.997266          547       365.71
     266.239     0.997656          547       426.67
     266.239     0.998047          547       512.00
     270.847     0.998242          548       568.89
     270.847     1.000000          548          inf
#[Mean    =        5.060, StdDeviation   =       20.122]
#[Max     =      270.592, Total count    =          548]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  602 requests in 2.00m, 143.13KB read
  Non-2xx or 3xx responses: 4
Requests/sec:      5.02
Transfer/sec:      1.19KB