experiment/raw/rolling_run3_wrk_stdout.txt
Running 2m test @ http://192.168.49.2:30080/health
  2 threads and 4 connections
  Thread calibration: mean lat.: 3.851ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 6.901ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.85ms   11.87ms  86.53ms   97.08%
    Req/Sec     2.63     19.83   222.00     98.05%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.67ms
 75.000%    4.80ms
 90.000%    6.13ms
 99.000%   84.93ms
 99.900%   85.69ms
 99.990%   86.59ms
 99.999%   86.59ms
100.000%   86.59ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.967     0.000000            1         1.00
       2.335     0.100000           55         1.11
       2.791     0.200000          110         1.25
       3.059     0.300000          165         1.43
       3.327     0.400000          220         1.67
       3.675     0.500000          274         2.00
       3.879     0.550000          302         2.22
       4.029     0.600000          329         2.50
       4.287     0.650000          357         2.86
       4.475     0.700000          387         3.33
       4.795     0.750000          412         4.00
       4.915     0.775000          425         4.44
       5.055     0.800000          439         5.00
       5.251     0.825000          453         5.71
       5.479     0.850000          466         6.67
       5.743     0.875000          480         8.00
       6.039     0.887500          487         8.89
       6.203     0.900000          494        10.00
       6.315     0.912500          501        11.43
       6.591     0.925000          507        13.33
       7.163     0.937500          514        16.00
       7.495     0.943750          518        17.78
       8.059     0.950000          521        20.00
       8.399     0.956250          525        22.86
       9.631     0.962500          528        26.67
      10.503     0.968750          531        32.00
      23.071     0.971875          533        35.56
      41.887     0.975000          535        40.00
      58.463     0.978125          537        45.71
      70.719     0.981250          538        53.33
      84.607     0.984375          540        64.00
      84.799     0.985938          541        71.11
      84.863     0.987500          542        80.00
      84.927     0.989062          543        91.43
      84.927     0.990625          543       106.67
      85.375     0.992188          545       128.00
      85.375     0.992969          545       142.22
      85.375     0.993750          545       160.00
      85.439     0.994531          546       182.86
      85.439     0.995313          546       213.33
      85.439     0.996094          546       256.00
      85.695     0.996484          547       284.44
      85.695     0.996875          547       320.00
      85.695     0.997266          547       365.71
      85.695     0.997656          547       426.67
      85.695     0.998047          547       512.00
      86.591     0.998242          548       568.89
      86.591     1.000000          548          inf
#[Mean    =        5.850, StdDeviation   =       11.870]
#[Max     =       86.528, Total count    =          548]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  602 requests in 2.00m, 139.33KB read
Requests/sec:      5.02
Transfer/sec:      1.16KB