experiment/raw/rolling_run4_wrk_stdout.txt
Running 2m test @ http://192.168.49.2:30080/health
  2 threads and 4 connections
  Thread calibration: mean lat.: 4.406ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 3.796ms, rate sampling interval: 11ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.96ms    7.66ms 100.61ms   96.53%
    Req/Sec     2.62     18.89   200.00     97.88%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.72ms
 75.000%    4.51ms
 90.000%    5.64ms
 99.000%   35.17ms
 99.900%   99.20ms
 99.990%  100.67ms
 99.999%  100.67ms
100.000%  100.67ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.087     0.000000            1         1.00
       2.303     0.100000           55         1.11
       2.731     0.200000          110         1.25
       3.069     0.300000          165         1.43
       3.431     0.400000          220         1.67
       3.721     0.500000          275         2.00
       3.873     0.550000          302         2.22
       4.029     0.600000          330         2.50
       4.163     0.650000          358         2.86
       4.335     0.700000          385         3.33
       4.507     0.750000          411         4.00
       4.675     0.775000          425         4.44
       4.839     0.800000          439         5.00
       4.995     0.825000          453         5.71
       5.179     0.850000          466         6.67
       5.439     0.875000          480         8.00
       5.503     0.887500          487         8.89
       5.667     0.900000          494        10.00
       5.815     0.912500          501        11.43
       6.183     0.925000          507        13.33
       6.387     0.937500          514        16.00
       6.887     0.943750          518        17.78
       7.379     0.950000          521        20.00
       8.175     0.956250          525        22.86
      10.247     0.962500          528        26.67
      23.983     0.968750          531        32.00
      24.943     0.971875          533        35.56
      27.343     0.975000          535        40.00
      28.575     0.978125          537        45.71
      28.607     0.981250          538        53.33
      29.407     0.984375          540        64.00
      29.423     0.985938          541        71.11
      32.207     0.987500          542        80.00
      35.167     0.989062          543        91.43
      35.167     0.990625          543       106.67
      40.223     0.992188          544       128.00
      44.095     0.992969          545       142.22
      44.095     0.993750          545       160.00
      53.887     0.994531          546       182.86
      53.887     0.995313          546       213.33
      53.887     0.996094          546       256.00
      99.199     0.996484          547       284.44
      99.199     0.996875          547       320.00
      99.199     0.997266          547       365.71
      99.199     0.997656          547       426.67
      99.199     0.998047          547       512.00
     100.671     0.998242          548       568.89
     100.671     1.000000          548          inf
#[Mean    =        4.959, StdDeviation   =        7.658]
#[Max     =      100.608, Total count    =          548]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  602 requests in 2.00m, 142.93KB read
  Non-2xx or 3xx responses: 1
Requests/sec:      5.02
Transfer/sec:      1.19KB